WS/conecta3x3.insertChip.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:conecta3x3ns="urn:conecta3x3ns">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <conecta3x3ns:insertChip>
   <playerName>
    <msg></msg>
   </playerName>
   <pos>0</pos>
  </conecta3x3ns:insertChip>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
